
{
  "format": "layers-model", 
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v1.2.6",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "batch_input_shape": [null, 112, 112, 3],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "activation": "relu"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["face_landmark_68_model-shard1"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}
      ]
    }
  ]
}
