
{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v1.2.6",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, null, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [["predictions", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["tiny_face_detector_model-shard1"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}
      ]
    }
  ]
}
